wajmh/Code/Firmware/GD32F50x_Firmware_Library/Firmware/GD32F50x_standard_peripheral/Source/gd32f50x_can.c
/*!
    \file    gd32f50x_can.c
    \brief   CAN driver

    \version 2025-11-10, V1.0.1, firmware for GD32F50x
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32f50x_can.h"
#include <stdlib.h>

#define CAN_ERROR_HANDLE(s)     do{}while(1)

/* CAN related register mask */
#define CAN_FDCTL_MASK              0x0000007FU
#define CAN_TMP_MASK                0xFFFF01BFU
#define CAN_INTEN_MASK              0x00038F7FU

/* This table can be used to calculate data length in FD mode */
const uint8_t g_can_fdlength_table[] = {12U, 16U, 20U, 24U, 32U, 48U, 64U};

/*!
    \brief      deinitialize CAN (API_ID(0x0001U))
    \param[in]  can_periph
    \arg          CANx(x=0,1)
    \param[out] none
    \retval     none
*/
void can_deinit(uint32_t can_periph)
{
    if(CAN0 == can_periph) {
        rcu_periph_reset_enable(RCU_CAN0RST);
        rcu_periph_reset_disable(RCU_CAN0RST);
    } else {
        rcu_periph_reset_enable(RCU_CAN1RST);
        rcu_periph_reset_disable(RCU_CAN1RST);
    }
}

/*!
    \brief      initialize CAN parameter struct with a default value (API_ID(0x0002U))
    \param[in]  type: the type of CAN parameter struct
                only one parameter can be selected which is shown as below:
      \arg        CAN_INIT_STRUCT: the CAN initial struct
      \arg        CAN_FILTER_STRUCT: the CAN filter struct
      \arg        CAN_FD_FRAME_STRUCT: the CAN FD initial struct
      \arg        CAN_TX_MESSAGE_STRUCT: the CAN TX message struct
      \arg        CAN_RX_MESSAGE_STRUCT: the CAN RX message struct
    \param[in]  p_struct: the pointer of the specific struct
    \param[out] none
    \retval     none
*/
void can_struct_para_init(can_struct_type_enum type, void *p_struct)
{
    uint8_t i;

#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(p_struct)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0002U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* get type of the struct */
        switch(type) {
            /* used for can_init() */
            case CAN_INIT_STRUCT:
                ((can_parameter_struct *)p_struct)->auto_bus_off_recovery = DISABLE;
                ((can_parameter_struct *)p_struct)->auto_retrans = DISABLE;
                ((can_parameter_struct *)p_struct)->auto_wake_up = DISABLE;
                ((can_parameter_struct *)p_struct)->prescaler = 0x0400U;
                ((can_parameter_struct *)p_struct)->rec_fifo_overwrite = DISABLE;
                ((can_parameter_struct *)p_struct)->resync_jump_width = CAN_BT_SJW_1TQ;
                ((can_parameter_struct *)p_struct)->time_segment_1 = CAN_BT_BS1_3TQ;
                ((can_parameter_struct *)p_struct)->time_segment_2 = CAN_BT_BS2_1TQ;
                ((can_parameter_struct *)p_struct)->time_triggered = DISABLE;
                ((can_parameter_struct *)p_struct)->trans_fifo_order = DISABLE;
                ((can_parameter_struct *)p_struct)->working_mode = CAN_NORMAL_MODE;

                break;
            /* used for can_filter_init() */
            case CAN_FILTER_STRUCT:
                ((can_filter_parameter_struct *)p_struct)->filter_bits = CAN_FILTERBITS_32BIT;
                ((can_filter_parameter_struct *)p_struct)->filter_enable = DISABLE;
                ((can_filter_parameter_struct *)p_struct)->filter_fifo_number = CAN_FIFO0;
                ((can_filter_parameter_struct *)p_struct)->filter_list_high = 0x0000U;
                ((can_filter_parameter_struct *)p_struct)->filter_list_low = 0x0000U;
                ((can_filter_parameter_struct *)p_struct)->filter_mask_high = 0x0000U;
                ((can_filter_parameter_struct *)p_struct)->filter_mask_low = 0x0000U;
                ((can_filter_parameter_struct *)p_struct)->filter_mode = CAN_FILTERMODE_MASK;
                ((can_filter_parameter_struct *)p_struct)->filter_number = 0U;

                break;
            /* used for can_fd_init() */
            case CAN_FD_FRAME_STRUCT:
                ((can_fdframe_struct *)p_struct)->data_prescaler = 0x0400U;
                ((can_fdframe_struct *)p_struct)->data_resync_jump_width = 1U - 1U;
                ((can_fdframe_struct *)p_struct)->data_time_segment_1 = 3U - 1U;
                ((can_fdframe_struct *)p_struct)->data_time_segment_2 = 2U - 1U;
                ((can_fdframe_struct *)p_struct)->delay_compensation = DISABLE;
                ((can_fdframe_struct *)p_struct)->esi_mode = CAN_ESIMOD_HARDWARE;
                ((can_fdframe_struct *)p_struct)->excp_event_detect = ENABLE;
                ((can_fdframe_struct *)p_struct)->fd_frame = DISABLE;
                ((can_fdframe_struct *)p_struct)->iso_bosch = CAN_FDMOD_ISO;
                ((can_fdframe_struct *)p_struct)->edge_filter_disable = CAN_EDGE_FILTERING_DISABLE;
                ((can_fdframe_struct *)p_struct)->p_delay_compensation = 0U;

                break;
            /* used for can_message_transmit() */
            case CAN_TX_MESSAGE_STRUCT:
                ((can_transmit_message_struct *)p_struct)->fd_brs = CAN_BRS_DISABLE;
                ((can_transmit_message_struct *)p_struct)->fd_esi = CAN_ESI_DOMINANT;
                ((can_transmit_message_struct *)p_struct)->fd_flag = CAN_FDF_CLASSIC;

                for(i = 0U; i < 64U; i++) {
                    ((can_transmit_message_struct *)p_struct)->tx_data[i] = 0U;
                }

                ((can_transmit_message_struct *)p_struct)->tx_dlen = 0U;
                ((can_transmit_message_struct *)p_struct)->tx_efid = 0U;
                ((can_transmit_message_struct *)p_struct)->tx_ff = (uint8_t)CAN_FF_STANDARD;
                ((can_transmit_message_struct *)p_struct)->tx_ft = (uint8_t)CAN_FT_DATA;
                ((can_transmit_message_struct *)p_struct)->tx_sfid = 0U;

                break;
            /* used for can_message_receive() */
            case CAN_RX_MESSAGE_STRUCT:
                ((can_receive_message_struct *)p_struct)->fd_brs = CAN_BRS_DISABLE;
                ((can_receive_message_struct *)p_struct)->fd_esi = CAN_ESI_DOMINANT;
                ((can_receive_message_struct *)p_struct)->fd_flag = CAN_FDF_CLASSIC;

                for(i = 0U; i < 64U; i++) {
                    ((can_receive_message_struct *)p_struct)->rx_data[i] = 0U;
                }

                ((can_receive_message_struct *)p_struct)->rx_dlen = 0U;
                ((can_receive_message_struct *)p_struct)->rx_efid = 0U;
                ((can_receive_message_struct *)p_struct)->rx_ff = (uint8_t)CAN_FF_STANDARD;
                ((can_receive_message_struct *)p_struct)->rx_fi = 0U;
                ((can_receive_message_struct *)p_struct)->rx_ft = (uint8_t)CAN_FT_DATA;
                ((can_receive_message_struct *)p_struct)->rx_sfid = 0U;

                break;

            default:
                break;
        }
    }
}

/*!
    \brief      initialize CAN (API_ID(0x0003U))
    \param[in]  can_periph
      \arg        CANx(x=0,1)
    \param[in]  can_parameter_init: parameters for CAN initialization
      \arg        working_mode: CAN_NORMAL_MODE, CAN_LOOPBACK_MODE, CAN_SILENT_MODE, CAN_SILENT_LOOPBACK_MODE
      \arg        resync_jump_width: 0x00 - 0x07
      \arg        time_segment_1: 0x00 - 0x7F
      \arg        time_segment_2: 0x00 - 0x1F
      \arg        time_triggered: ENABLE or DISABLE
      \arg        auto_bus_off_recovery: ENABLE or DISABLE
      \arg        auto_wake_up: ENABLE or DISABLE
      \arg        auto_retrans: ENABLE or DISABLE
      \arg        rec_fifo_overwrite: ENABLE or DISABLE
      \arg        trans_fifo_order: ENABLE or DISABLE
      \arg        prescaler: 0x0001 - 0x0400
    \param[out] none
    \retval     ErrStatus: SUCCESS or ERROR
    \note       This function includes timeout exit scenarios.
                Modify according to the user's actual usage scenarios.
*/
ErrStatus can_init(uint32_t can_periph, can_parameter_struct *can_parameter_init)
{
    uint32_t timeout = CAN_TIMEOUT;
    ErrStatus reval = ERROR;
    uint32_t fdctl_status;

