wajmh/Code/Firmware/GD32F50x_Firmware_Library/Firmware/GD32F50x_standard_peripheral/Source/gd32f50x_can.c
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(can_parameter_init)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0003U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* disable sleep mode */
        CAN_CTL(can_periph) &= ~CAN_CTL_SLPWMOD;
        /* enable initialize mode */
        CAN_CTL(can_periph) |= CAN_CTL_IWMOD;
        /* wait ACK */
        while((CAN_STAT_IWS != (CAN_STAT(can_periph) & CAN_STAT_IWS)) && (0U != timeout)) {
            timeout--;
        }
        /* check initialize working success */
        if(CAN_STAT_IWS != (CAN_STAT(can_periph) & CAN_STAT_IWS)) {
            reval = ERROR;
        } else {
            /* set the bit timing register */
            fdctl_status = CAN_FDCTL(can_periph);
            if(CAN_FDCTL_FDEN != (fdctl_status & CAN_FDCTL_FDEN)) {
                /* CAN FD disable, should first enable, then write */
                fdctl_status = fdctl_status | CAN_FDCTL_FDEN;
                CAN_FDCTL(can_periph) = fdctl_status;
                CAN_BT(can_periph) = (BT_MODE((uint32_t)can_parameter_init->working_mode) | \
                                      BT_SJW((uint32_t)can_parameter_init->resync_jump_width) | \
                                      BT_BS1((uint32_t)can_parameter_init->time_segment_1) | \
                                      BT_BS2((uint32_t)can_parameter_init->time_segment_2) | \
                                      BT_BAUDPSC(((uint32_t)(can_parameter_init->prescaler) - 1U)));
                fdctl_status = fdctl_status & (~CAN_FDCTL_FDEN);
                CAN_FDCTL(can_periph) = fdctl_status;
            } else {
                /* CAN FD enable */
                CAN_BT(can_periph) = (BT_MODE((uint32_t)can_parameter_init->working_mode) | \
                                      BT_SJW((uint32_t)can_parameter_init->resync_jump_width) | \
                                      BT_BS1((uint32_t)can_parameter_init->time_segment_1) | \
                                      BT_BS2((uint32_t)can_parameter_init->time_segment_2) | \
                                      BT_BAUDPSC(((uint32_t)(can_parameter_init->prescaler) - 1U)));
            }

            /* time trigger communication mode */
            if(ENABLE == can_parameter_init->time_triggered) {
                CAN_CTL(can_periph) |= CAN_CTL_TTC;
            } else {
                CAN_CTL(can_periph) &= ~CAN_CTL_TTC;
            }
            /* automatic bus-off management */
            if(ENABLE == can_parameter_init->auto_bus_off_recovery) {
                CAN_CTL(can_periph) |= CAN_CTL_ABOR;
            } else {
                CAN_CTL(can_periph) &= ~CAN_CTL_ABOR;
            }
            /* automatic wakeup mode */
            if(ENABLE == can_parameter_init->auto_wake_up) {
                CAN_CTL(can_periph) |= CAN_CTL_AWU;
            } else {
                CAN_CTL(can_periph) &= ~CAN_CTL_AWU;
            }
            /* automatic retransmission mode */
            if(ENABLE == can_parameter_init->auto_retrans) {
                CAN_CTL(can_periph) &= ~CAN_CTL_ARD;
            } else {
                CAN_CTL(can_periph) |= CAN_CTL_ARD;
            }
            /* receive FIFO overwrite mode */
            if(ENABLE == can_parameter_init->rec_fifo_overwrite) {
                CAN_CTL(can_periph) &= ~CAN_CTL_RFOD;
            } else {
                CAN_CTL(can_periph) |= CAN_CTL_RFOD;
            }
            /* transmit FIFO order */
            if(ENABLE == can_parameter_init->trans_fifo_order) {
                CAN_CTL(can_periph) |= CAN_CTL_TFO;
            } else {
                CAN_CTL(can_periph) &= ~CAN_CTL_TFO;
            }
            /* disable initialize mode */
            CAN_CTL(can_periph) &= ~CAN_CTL_IWMOD;
            timeout = CAN_TIMEOUT;
            /* wait the ACK */
            while((CAN_STAT_IWS == (CAN_STAT(can_periph) & CAN_STAT_IWS)) && (0U != timeout)) {
                timeout--;
            }
            /* check exit initialize mode */
            if(0U != timeout) {
                reval = SUCCESS;
            }
        }
    }
    return reval;
}

/*!
    \brief      initialize CAN FD function (API_ID(0x0004U))
    \param[in]  can_periph
      \arg        CANx(x=0,1)
    \param[in]  can_fdframe_init: parameters for CAN FD initializtion
      \arg        fd_frame: ENABLE or DISABLE
      \arg        excp_event_detect: ENABLE or DISABLE
      \arg        delay_compensation: ENABLE or DISABLE
      \arg        p_delay_compensation: the pointer of tdc struct
                  can_fd_tdc_struct:
                    tdc_mode: CAN_TDCMOD_CALC_AND_OFFSET or CAN_TDCMOD_OFFSET
                    tdc_filter: 0x00 - 0x07
                    tdc_offset: 0x00 - 0x07
      \arg        edge_filter_disable: CAN_EDGE_FILTERING_ENABLE or CAN_EDGE_FILTERING_DISABLE
      \arg        iso_bosch: CAN_FDMOD_ISO or CAN_FDMOD_BOSCH
      \arg        esi_mode: CAN_ESIMOD_HARDWARE or CAN_ESIMOD_SOFTWARE
      \arg        data_resync_jump_width: 0x00 - 0x07
      \arg        data_time_segment_1: 0x00 - 0x0F
      \arg        data_time_segment_2: 0x00 - 0x07
      \arg        data_prescaler: 0x0001 - 0x0400
    \param[out] none
    \retval     ErrStatus: SUCCESS or ERROR
    \note       This function includes timeout exit scenarios.
                Modify according to the user's actual usage scenarios.
*/
ErrStatus can_fd_init(uint32_t can_periph, can_fdframe_struct *can_fdframe_init)
{
    uint32_t timeout = CAN_TIMEOUT;
    uint32_t tempreg = 0U;
    ErrStatus reval = SUCCESS;

#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(can_fdframe_init)) {
        reval = ERROR;
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0004U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* disable sleep mode */
        CAN_CTL(can_periph) &= ~CAN_CTL_SLPWMOD;
        /* enable initialize mode */
        CAN_CTL(can_periph) |= CAN_CTL_IWMOD;
        /* wait ACK */
        while((CAN_STAT_IWS != (CAN_STAT(can_periph) & CAN_STAT_IWS)) && (0U != timeout)) {
            timeout--;
        }
        /* check initialize working success */
        if(CAN_STAT_IWS != (CAN_STAT(can_periph) & CAN_STAT_IWS)) {
            reval = ERROR;
        } else {
            /* set the data bit timing register */
            CAN_DBT(can_periph) = (BT_DSJW((uint32_t)can_fdframe_init->data_resync_jump_width) | \
                                   BT_DBS1((uint32_t)can_fdframe_init->data_time_segment_1) | \
                                   BT_DBS2((uint32_t)can_fdframe_init->data_time_segment_2) | \
                                   BT_BAUDPSC(((uint32_t)can_fdframe_init->data_prescaler) - 1U));

            tempreg = can_fdframe_init->esi_mode | can_fdframe_init->iso_bosch | \
                      can_fdframe_init->edge_filter_disable;

            /* Protocol exception event detection */
            if(ENABLE == can_fdframe_init->excp_event_detect) {
                tempreg &= ~CAN_FDCTL_PRED;
            } else {
                tempreg |= CAN_FDCTL_PRED;
            }

            /* Transmitter delay compensation mode */
            if(ENABLE == can_fdframe_init->delay_compensation) {
                tempreg |= CAN_FDCTL_TDCEN;
                /* p_delay_compensation pointer should be config when TDC mode is enabled */
                if(0 != can_fdframe_init->p_delay_compensation) {
                    tempreg |= (can_fdframe_init->p_delay_compensation->tdc_mode & CAN_FDCTL_TDCMOD);
                    CAN_FDTDC(can_periph) = (FDTDC_TDCF(can_fdframe_init->p_delay_compensation->tdc_filter) | \
                                             FDTDC_TDCO(can_fdframe_init->p_delay_compensation->tdc_offset));
                } else {
                    reval = ERROR;
                }
            } else {
                /* Transmitter delay compensation mode is disabled */
                tempreg &= ~CAN_FDCTL_TDCEN;
            }

            /* FD operation mode */
            if(ENABLE == can_fdframe_init->fd_frame) {
                tempreg |= CAN_FDCTL_FDEN;
            } else {
                tempreg &= ~CAN_FDCTL_FDEN;
            }
            CAN_FDCTL(can_periph) = tempreg & CAN_FDCTL_MASK;

