wajmh/Code/Firmware/GD32F50x_Firmware_Library/Firmware/GD32F50x_standard_peripheral/Source/gd32f50x_can.c
            /* disable initialize mode */
            CAN_CTL(can_periph) &= ~CAN_CTL_IWMOD;
            timeout = CAN_TIMEOUT;
            /* wait the ACK */
            while((CAN_STAT_IWS == (CAN_STAT(can_periph) & CAN_STAT_IWS)) && (0U != timeout)) {
                timeout--;
            }
            /* check exit initialize mode */
            if(0U == timeout) {
                reval = ERROR;
            }
        }
    }
    return reval;
}

/*!
    \brief      initialize CAN filter (API_ID(0x0005U))
    \param[in]  can_filter_parameter_init: struct for CAN filter initialization
      \arg        filter_list_high: 0x0000 - 0xFFFF
      \arg        filter_list_low: 0x0000 - 0xFFFF
      \arg        filter_mask_high: 0x0000 - 0xFFFF
      \arg        filter_mask_low: 0x0000 - 0xFFFF
      \arg        filter_fifo_number: CAN_FIFO0, CAN_FIFO1
      \arg        filter_number: 0 - 27
      \arg        filter_mode: CAN_FILTERMODE_MASK, CAN_FILTERMODE_LIST
      \arg        filter_bits: CAN_FILTERBITS_32BIT, CAN_FILTERBITS_16BIT
      \arg        filter_enable: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void can_filter_init(can_filter_parameter_struct *can_filter_parameter_init)
{
    uint32_t val = 0U;

#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(can_filter_parameter_init)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0005U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        val = ((uint32_t)1) << (can_filter_parameter_init->filter_number);
        /* filter lock disable */
        CAN_FCTL |= CAN_FCTL_FLD;
        /* disable filter */
        CAN_FW &= ~(uint32_t)val;

        /* filter 16 bits */
        if(CAN_FILTERBITS_16BIT == can_filter_parameter_init->filter_bits) {
            /* set filter 16 bits */
            CAN_FSCFG &= ~(uint32_t)val;
            /* first 16 bits list and first 16 bits mask or first 16 bits list and second 16 bits list */
            CAN_FDATA0(can_filter_parameter_init->filter_number) = \
                                                                   FDATA_MASK_HIGH((can_filter_parameter_init->filter_mask_low) & CAN_FILTER_MASK_16BITS) | \
                                                                   FDATA_MASK_LOW((can_filter_parameter_init->filter_list_low) & CAN_FILTER_MASK_16BITS);
            /* second 16 bits list and second 16 bits mask or third 16 bits list and fourth 16 bits list */
            CAN_FDATA1(can_filter_parameter_init->filter_number) = \
                                                                   FDATA_MASK_HIGH((can_filter_parameter_init->filter_mask_high) & CAN_FILTER_MASK_16BITS) | \
                                                                   FDATA_MASK_LOW((can_filter_parameter_init->filter_list_high) & CAN_FILTER_MASK_16BITS);
        }
        /* filter 32 bits */
        if(CAN_FILTERBITS_32BIT == can_filter_parameter_init->filter_bits) {
            /* set filter 32 bits */
            CAN_FSCFG |= (uint32_t)val;
            /* 32 bits list or first 32 bits list */
            CAN_FDATA0(can_filter_parameter_init->filter_number) = \
                                                                   FDATA_MASK_HIGH((can_filter_parameter_init->filter_list_high) & CAN_FILTER_MASK_16BITS) |
                                                                   FDATA_MASK_LOW((can_filter_parameter_init->filter_list_low) & CAN_FILTER_MASK_16BITS);
            /* 32 bits mask or second 32 bits list */
            CAN_FDATA1(can_filter_parameter_init->filter_number) = \
                                                                   FDATA_MASK_HIGH((can_filter_parameter_init->filter_mask_high) & CAN_FILTER_MASK_16BITS) |
                                                                   FDATA_MASK_LOW((can_filter_parameter_init->filter_mask_low) & CAN_FILTER_MASK_16BITS);
        }

        /* filter mode */
        if(CAN_FILTERMODE_MASK == can_filter_parameter_init->filter_mode) {
            /* mask mode */
            CAN_FMCFG &= ~(uint32_t)val;
        } else {
            /* list mode */
            CAN_FMCFG |= (uint32_t)val;
        }

        /* filter FIFO */
        if(CAN_FIFO0 == (can_filter_parameter_init->filter_fifo_number)) {
            /* FIFO0 */
            CAN_FAFIFO &= ~(uint32_t)val;
        } else {
            /* FIFO1 */
            CAN_FAFIFO |= (uint32_t)val;
        }

        /* filter working */
        if(ENABLE == can_filter_parameter_init->filter_enable) {

            CAN_FW |= (uint32_t)val;
        }

        /* filter lock enable */
        CAN_FCTL &= ~CAN_FCTL_FLD;
    }
}

/*!
    \brief      CAN filter mask mode initialization (API_ID(0x0006U))
    \param[in]  id: extended(11-bits) or standard(29-bits) identifier
      \arg        0x00000000 - 0x1FFFFFFF
    \param[in]  mask: extended(11-bits) or standard(29-bits) identifier mask
      \arg        0x00000000 - 0x1FFFFFFF
    \param[in]  format_fifo: format and FIFO states
                only one parameter can be selected which is shown as below:
      \arg        CAN_STANDARD_FIFO0
      \arg        CAN_STANDARD_FIFO1
      \arg        CAN_EXTENDED_FIFO0
      \arg        CAN_EXTENDED_FIFO1
    \param[in]  filter_number: filter sequence number
      \arg        0x00 - 0x1B
    \param[out] none
    \retval     none
*/
void can_filter_mask_mode_init(uint32_t id, uint32_t mask, can_format_fifo_enum format_fifo,
                               uint16_t filter_number)
{
    can_filter_parameter_struct can_filter;

    /* Initialize the filter structure */
    can_struct_para_init(CAN_FILTER_STRUCT, &can_filter);

    /* filter config */
    can_filter.filter_number = filter_number;
    can_filter.filter_mode = CAN_FILTERMODE_MASK;
    can_filter.filter_bits = CAN_FILTERBITS_32BIT;
    can_filter.filter_enable = ENABLE;

    switch(format_fifo) {
        /* standard FIFO 0 */
        case CAN_STANDARD_FIFO0:
            can_filter.filter_fifo_number = CAN_FIFO0;
            /* configure SFID[10:0] */
            can_filter.filter_list_high = (uint16_t)id << 5U;
            can_filter.filter_list_low = 0x0000U;
            /* configure SFID[10:0] mask */
            can_filter.filter_mask_high = (uint16_t)mask << 5U;
            /* both data and remote frames can be received */
            can_filter.filter_mask_low = (uint16_t)(1U << 2U);

            break;
        /* standard FIFO 1 */
        case CAN_STANDARD_FIFO1:
            can_filter.filter_fifo_number = CAN_FIFO1;
            /* configure SFID[10:0] */
            can_filter.filter_list_high = (uint16_t)id << 5U;
            can_filter.filter_list_low =  0x0000U;
            /* configure SFID[10:0] mask */
            can_filter.filter_mask_high = (uint16_t)mask << 5U;
            /* both data and remote frames can be received */
            can_filter.filter_mask_low = (uint16_t)(1U << 2U);

            break;
        /* extended FIFO 0 */
        case CAN_EXTENDED_FIFO0:
            can_filter.filter_fifo_number = CAN_FIFO0;
            /* configure EFID[28:13] */
            can_filter.filter_list_high = (uint16_t)(id >> 13U);
            /* configure EFID[12:0] and frame format bit set */
            can_filter.filter_list_low = ((uint16_t)(id << 3U)) | (1U << 2U);
            /* configure EFID[28:13] mask */
            can_filter.filter_mask_high = (uint16_t)(mask >> 13U);
            /* configure EFID[12:0] and frame format bit mask */
            /* both data and remote frames can be received */
            can_filter.filter_mask_low = ((uint16_t)(mask << 3U)) | (1U << 2U);

            break;
        /* extended FIFO 1 */
        case CAN_EXTENDED_FIFO1:
            can_filter.filter_fifo_number = CAN_FIFO1;
            /* configure EFID[28:13] */
            can_filter.filter_list_high = (uint16_t)(id >> 13U);
            /* configure EFID[12:0] and frame format bit set */
            can_filter.filter_list_low = ((uint16_t)(id << 3U)) | (1U << 2U);
            /* configure EFID[28:13] mask */
            can_filter.filter_mask_high = (uint16_t)(mask >> 13U);
            /* configure EFID[12:0] and frame format bit mask */
            /* both data and remote frames can be received */
            can_filter.filter_mask_low = ((uint16_t)(mask << 3U)) | (1U << 2U);

            break;
        default:
            CAN_ERROR_HANDLE("parameter is invalid \r\n");
    }

