wajmh/Code/Firmware/GD32F50x_Firmware_Library/Firmware/GD32F50x_standard_peripheral/Source/gd32f50x_can.c
    can_filter_init(&can_filter);
}

/*!
    \brief      CAN communication mode configure (API_ID(0x0007U))
    \param[in]  can_periph
      \arg        CANx(x=0,1)
    \param[in]  mode: communication mode
                only one parameter can be selected which is shown as below:
      \arg        CAN_NORMAL_MODE
      \arg        CAN_LOOPBACK_MODE
      \arg        CAN_SILENT_MODE
      \arg        CAN_SILENT_LOOPBACK_MODE
    \param[out] none
    \retval     ErrStatus: SUCCESS or ERROR
    \note       This function includes timeout exit scenarios.
                Modify according to the user's actual usage scenarios.
*/
ErrStatus can_monitor_mode_set(uint32_t can_periph, uint8_t mode)
{
    ErrStatus reval = SUCCESS;
    uint32_t timeout = CAN_TIMEOUT;

    if(mode == (mode & CAN_SILENT_LOOPBACK_MODE)) {
        /* disable sleep mode */
        CAN_CTL(can_periph) &= (~(uint32_t)CAN_CTL_SLPWMOD);
        /* set initialize mode */
        CAN_CTL(can_periph) |= (uint8_t)CAN_CTL_IWMOD;
        /* wait the acknowledge */
        timeout = CAN_TIMEOUT;
        while((CAN_STAT_IWS != (CAN_STAT(can_periph) & CAN_STAT_IWS)) && (0U != timeout)) {
            timeout--;
        }

        if(CAN_STAT_IWS != (CAN_STAT(can_periph) & CAN_STAT_IWS)) {
            reval = ERROR;
        } else {
            CAN_BT(can_periph) &= ~BT_MODE(3);
            CAN_BT(can_periph) |= BT_MODE(mode);

            timeout = CAN_TIMEOUT;
            /* enter normal mode */
            CAN_CTL(can_periph) &= ~(uint32_t)(CAN_CTL_SLPWMOD | CAN_CTL_IWMOD);
            /* wait the acknowledge */
            while((0U != (CAN_STAT(can_periph) & (CAN_STAT_IWS | CAN_STAT_SLPWS))) && (0U != timeout)) {
                timeout--;
            }
            if(0U != (CAN_STAT(can_periph) & (CAN_STAT_IWS | CAN_STAT_SLPWS))) {
                reval = ERROR;
            }
        }
    } else {
        reval = ERROR;
    }

    return reval;
}

/*!
    \brief      CAN FD frame function enable (API_ID(0x0008U))
    \param[in]  can_periph
    \arg          CANx(x=0,1)
    \param[out] none
    \retval     none
*/
void can_fd_function_enable(uint32_t can_periph)
{
    CAN_FDCTL(can_periph) |= CAN_FDCTL_FDEN;
}

/*!
    \brief      CAN FD frame function disable (API_ID(0x0009U))
    \param[in]  can_periph
    \arg          CANx(x=0,1)
    \param[out] none
    \retval     none
*/
void can_fd_function_disable(uint32_t can_periph)
{
    CAN_FDCTL(can_periph) &= ~CAN_FDCTL_FDEN;
}

/*!
    \brief      set CAN1 filter start bank number (API_ID(0x000AU))
    \param[in]  start_bank: CAN1 start bank number
                only one parameter can be selected which is shown as below:
      \arg        (1..27)
    \param[out] none
    \retval     none
*/
void can1_filter_start_bank(uint8_t start_bank)
{
    /* filter lock disable */
    CAN_FCTL |= CAN_FCTL_FLD;
    /* set CAN1 filter start number */
    CAN_FCTL &= ~(uint32_t)CAN_FCTL_HBC1F;
    CAN_FCTL |= FCTL_HBC1F(start_bank);
    /* filter lock enable */
    CAN_FCTL &= ~CAN_FCTL_FLD;
}

/*!
    \brief      enable CAN debug freeze (API_ID(0x000BU))
    \param[in]  can_periph
    \arg        CANx(x=0,1)
    \param[out] none
    \retval     none
*/
void can_debug_freeze_enable(uint32_t can_periph)
{
    /* set DFZ bit */
    CAN_CTL(can_periph) |= CAN_CTL_DFZ;

    if(CAN0 == can_periph) {
        dbg_periph_enable(DBG_CAN0_HOLD);
    } else {
        dbg_periph_enable(DBG_CAN1_HOLD);
    }
}

/*!
    \brief      disable CAN debug freeze (API_ID(0x000CU))
    \param[in]  can_periph
    \arg        CANx(x=0,1)
    \param[out] none
    \retval     none
*/
void can_debug_freeze_disable(uint32_t can_periph)
{
    /* set DFZ bit */
    CAN_CTL(can_periph) &= ~CAN_CTL_DFZ;

    if(CAN0 == can_periph) {
        dbg_periph_disable(DBG_CAN0_HOLD);
    } else {
        dbg_periph_disable(DBG_CAN1_HOLD);
    }
}

/*!
    \brief      enable CAN time trigger mode (API_ID(0x000DU))
    \param[in]  can_periph
    \arg        CANx(x=0,1)
    \param[out] none
    \retval     none
*/
void can_time_trigger_mode_enable(uint32_t can_periph)
{
    uint8_t mailbox_number;

    /* enable the TTC mode */
    CAN_CTL(can_periph) |= CAN_CTL_TTC;
    /* enable time stamp */
    for(mailbox_number = 0U; mailbox_number < 3U; mailbox_number++) {
        CAN_TMP(can_periph, mailbox_number) |= CAN_TMP_TSEN;
    }
}

/*!
    \brief      disable CAN time trigger mode (API_ID(0x000EU))
    \param[in]  can_periph
    \arg        CANx(x=0,1)
    \param[out] none
    \retval     none
*/
void can_time_trigger_mode_disable(uint32_t can_periph)
{
    uint8_t mailbox_number;

    /* disable the TTC mode */
    CAN_CTL(can_periph) &= ~CAN_CTL_TTC;
    /* reset TSEN bits */
    for(mailbox_number = 0U; mailbox_number < 3U; mailbox_number++) {
        CAN_TMP(can_periph, mailbox_number) &= ~CAN_TMP_TSEN;
    }
}

/*!
    \brief      transmit CAN message (API_ID(0x000FU))
    \param[in]  can_periph
    \param[in]  transmit_message: struct for CAN transmit message
      \arg        tx_sfid: 0x00000000 - 0x000007FF
      \arg        tx_efid: 0x00000000 - 0x1FFFFFFF
      \arg        tx_ff: CAN_FF_STANDARD, CAN_FF_EXTENDED
      \arg        tx_ft: CAN_FT_DATA, CAN_FT_REMOTE
      \arg        tx_dlen: 0 - 8
      \arg        tx_data[]: 0x00 - 0xFF
    \param[out] none
    \retval     mailbox_number
*/
uint8_t can_message_transmit(uint32_t can_periph, can_transmit_message_struct *transmit_message)
{
    uint8_t mailbox_number = CAN_NOMAILBOX;
    volatile uint32_t p_temp;
    uint8_t i = 0U;
    uint8_t hit = 0U;
    uint32_t canfd_en = 0U;
    uint32_t reg_temp = 0U;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(transmit_message)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x000FU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* select one empty mailbox */
        if(CAN_TSTAT_TME0 == (CAN_TSTAT(can_periph)&CAN_TSTAT_TME0)) {
            mailbox_number = CAN_MAILBOX0;
        } else if(CAN_TSTAT_TME1 == (CAN_TSTAT(can_periph)&CAN_TSTAT_TME1)) {
            mailbox_number = CAN_MAILBOX1;
        } else if(CAN_TSTAT_TME2 == (CAN_TSTAT(can_periph)&CAN_TSTAT_TME2)) {
            mailbox_number = CAN_MAILBOX2;
        } else {
            mailbox_number = CAN_NOMAILBOX;
        }
        /* got one empty mailbox */
        if(CAN_NOMAILBOX != mailbox_number) {
            CAN_TMI(can_periph, mailbox_number) &= CAN_TMI_TEN;
            if(CAN_FF_STANDARD == transmit_message->tx_ff) {
                /* set transmit mailbox standard identifier */
                CAN_TMI(can_periph, mailbox_number) |= (uint32_t)(TMI_SFID(transmit_message->tx_sfid) | \
                                                                  (transmit_message->tx_ft & CAN_TMI_FT));
            } else {
                /* set transmit mailbox extended identifier */
                CAN_TMI(can_periph, mailbox_number) |= (uint32_t)(TMI_EFID(transmit_message->tx_efid) | \
                                                                  (transmit_message->tx_ff & CAN_TMI_FF) | \
                                                                  (transmit_message->tx_ft & CAN_TMI_FT));
            }
            if(CAN_FDF_CLASSIC == transmit_message->fd_flag) {
                /* set the data length */
                CAN_TMP(can_periph, mailbox_number) &= ~(CAN_TMP_DLENC | CAN_TMP_ESI | CAN_TMP_BRS | CAN_TMP_FDF);
                /* Classic CAN frame data length does not exceed 8 */
                if(transmit_message->tx_dlen > 8U) {
                    transmit_message->tx_dlen = 8U;
                }
                CAN_TMP(can_periph, mailbox_number) |= transmit_message->tx_dlen & CAN_TMP_DLENC;
                /* set the data */
                CAN_TMDATA0(can_periph, mailbox_number) = TMDATA0_DB3(transmit_message->tx_data[3]) | \
                                                          TMDATA0_DB2(transmit_message->tx_data[2]) | \
                                                          TMDATA0_DB1(transmit_message->tx_data[1]) | \
                                                          TMDATA0_DB0(transmit_message->tx_data[0]);
                CAN_TMDATA1(can_periph, mailbox_number) = TMDATA1_DB7(transmit_message->tx_data[7]) | \
                                                          TMDATA1_DB6(transmit_message->tx_data[6]) | \
                                                          TMDATA1_DB5(transmit_message->tx_data[5]) | \
                                                          TMDATA1_DB4(transmit_message->tx_data[4]);
            } else {
                canfd_en = CAN_FDCTL(can_periph) & CAN_FDCTL_FDEN;
                /* check FD function has been enabled */
                if(canfd_en) {
                    if(transmit_message->tx_dlen <= 8U) {
                        /* set the data length */
                        reg_temp |= transmit_message->tx_dlen & CAN_TMP_DLENC;
                    } else {
                        /* data length greater than 8 */
                        for(i = 0U; i < 7U; i++) {
                            if(transmit_message->tx_dlen == g_can_fdlength_table[i]) {
                                hit = 1U;
                                break;
                            }
                        }
                        /* data length is valid */
                        if(1U == hit) {
                            reg_temp |= 9U + i;
                        } else {
                            CAN_ERROR_HANDLE("dlen is invalid \r\n");
                        }
                    }
                    reg_temp |= (((uint32_t)transmit_message->fd_brs << 5U) | ((uint32_t)transmit_message->fd_esi << 4U) \
                                 | ((uint32_t)transmit_message->fd_flag << 7U));
                    CAN_TMP(can_periph, mailbox_number) = reg_temp & CAN_TMP_MASK;

                    /* set the data */
                    i = transmit_message->tx_dlen / 4U;

                    /* data length is 5-7 need send 2 word */
                    if((1U == i) && (4U != transmit_message->tx_dlen)) {
                        i++;
                    }
                    p_temp = (uint32_t)transmit_message->tx_data;
                    if((0U == i)) {
                        CAN_TMDATA0(can_periph, mailbox_number) = *(uint32_t *)p_temp;
                    } else {
                        for(; i > 0U; i--) {
                            CAN_TMDATA0(can_periph, mailbox_number) = *(uint32_t *)p_temp;
                            p_temp = ((uint32_t)((uint32_t)p_temp + 4U));
                        }
                    }

                } else {
                    CAN_ERROR_HANDLE("CAN FD function disabled \r\n");
                }
            }
            /* enable transmission */
            CAN_TMI(can_periph, mailbox_number) |= CAN_TMI_TEN;
        }
    }
    return mailbox_number;
}

/*!
    \brief      get CAN transmit state (API_ID(0x0010U))
    \param[in]  can_periph
    \param[in]  mailbox_number
                only one parameter can be selected which is shown as below:
      \arg        CAN_MAILBOX(x=0,1,2)
    \param[out] none
    \retval     can_transmit_state_enum
*/
can_transmit_state_enum can_transmit_states(uint32_t can_periph, uint8_t mailbox_number)
{
    can_transmit_state_enum state = CAN_TRANSMIT_FAILED;
    uint32_t val = 0U;

    /* check selected mailbox state */
    switch(mailbox_number) {
        /* mailbox0 */
        case CAN_MAILBOX0:
            val = CAN_TSTAT(can_periph) & (CAN_TSTAT_MTF0 | CAN_TSTAT_MTFNERR0 | CAN_TSTAT_TME0);
            break;
        /* mailbox1 */
        case CAN_MAILBOX1:
            val = CAN_TSTAT(can_periph) & (CAN_TSTAT_MTF1 | CAN_TSTAT_MTFNERR1 | CAN_TSTAT_TME1);
            break;
        /* mailbox2 */
        case CAN_MAILBOX2:
            val = CAN_TSTAT(can_periph) & (CAN_TSTAT_MTF2 | CAN_TSTAT_MTFNERR2 | CAN_TSTAT_TME2);
            break;
        default:
            val = CAN_TRANSMIT_FAILED;
            break;
    }

    switch(val) {
        /* transmit pending */
        case(CAN_STATE_PENDING):
            state = CAN_TRANSMIT_PENDING;
            break;
        /* mailbox0 transmit succeeded */
        case(CAN_TSTAT_MTF0 | CAN_TSTAT_MTFNERR0 | CAN_TSTAT_TME0):
            state = CAN_TRANSMIT_OK;
            break;
        /* mailbox1 transmit succeeded */
        case(CAN_TSTAT_MTF1 | CAN_TSTAT_MTFNERR1 | CAN_TSTAT_TME1):
            state = CAN_TRANSMIT_OK;
            break;
        /* mailbox2 transmit succeeded */
        case(CAN_TSTAT_MTF2 | CAN_TSTAT_MTFNERR2 | CAN_TSTAT_TME2):
            state = CAN_TRANSMIT_OK;
            break;
        /* transmit failed */
        default:
            state = CAN_TRANSMIT_FAILED;
            break;
    }
    return state;
}

/*!
    \brief      stop CAN transmission (API_ID(0x0011U))
    \param[in]  can_periph
    \param[in]  mailbox_number
                only one parameter can be selected which is shown as below:
      \arg        CAN_MAILBOXx(x=0,1,2)
    \param[out] none
    \retval     none
*/
void can_transmission_stop(uint32_t can_periph, uint8_t mailbox_number)
{
    /* timeout for CAN_TSTAT_MSTx bits */
    uint32_t timeout = CAN_TIMEOUT;

    if(CAN_MAILBOX0 == mailbox_number) {
        CAN_TSTAT(can_periph) |= CAN_TSTAT_MST0;
        while((CAN_TSTAT_MST0 == (CAN_TSTAT(can_periph) & CAN_TSTAT_MST0)) && (0U != timeout)) {
            timeout--;
        }
    } else if(CAN_MAILBOX1 == mailbox_number) {
        CAN_TSTAT(can_periph) |= CAN_TSTAT_MST1;
        while((CAN_TSTAT_MST1 == (CAN_TSTAT(can_periph) & CAN_TSTAT_MST1)) && (0U != timeout)) {
            timeout--;
        }
    } else if(CAN_MAILBOX2 == mailbox_number) {
        CAN_TSTAT(can_periph) |= CAN_TSTAT_MST2;
        while((CAN_TSTAT_MST2 == (CAN_TSTAT(can_periph) & CAN_TSTAT_MST2)) && (0U != timeout)) {
            timeout--;
        }
    } else {
        /* illegal parameters */
    }
}

/*!
    \brief      CAN receive message (API_ID(0x0012U))
    \param[in]  can_periph
    \param[in]  fifo_number
    \param[out] receive_message: struct for CAN receive message
      \arg        rx_sfid: 0x00000000 - 0x000007FF
      \arg        rx_efid: 0x00000000 - 0x1FFFFFFF
      \arg        rx_ff: CAN_FF_STANDARD, CAN_FF_EXTENDED
      \arg        rx_ft: CAN_FT_DATA, CAN_FT_REMOTE
      \arg        rx_dlen: 0 - 8
      \arg        rx_data[]: 0x00 - 0xFF
      \arg        rx_fi: 0 - 27
    \retval     none
*/
void can_message_receive(uint32_t can_periph, uint8_t fifo_number,
                         can_receive_message_struct *receive_message)
{
    volatile uint32_t p_temp;
    uint32_t canfd_en = 0U;
    uint32_t data_temp;
    uint8_t canfd_recv_cnt = 0U;
    uint8_t i;

