wajmh/Code/Firmware/GD32F50x_Firmware_Library/Firmware/GD32F50x_standard_peripheral/Source/gd32f50x_can.c
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(receive_message)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0012U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* get the frame format */
        receive_message->rx_ff = (uint8_t)(CAN_RFIFOMI_FF & CAN_RFIFOMI(can_periph, fifo_number));
        if(CAN_FF_STANDARD == receive_message->rx_ff) {
            /* get standard identifier */
            receive_message->rx_sfid = (uint32_t)(GET_RFIFOMI_SFID(CAN_RFIFOMI(can_periph, fifo_number)));
        } else {
            /* get extended identifier */
            receive_message->rx_efid = (uint32_t)(GET_RFIFOMI_EFID(CAN_RFIFOMI(can_periph, fifo_number)));
        }

        /* get frame type */
        receive_message->rx_ft = (uint8_t)(CAN_RFIFOMI_FT & CAN_RFIFOMI(can_periph, fifo_number));
        /* filtering index */
        receive_message->rx_fi = (uint8_t)(GET_RFIFOMP_FI(CAN_RFIFOMP(can_periph, fifo_number)));
        receive_message->fd_flag = (uint8_t)((CAN_RFIFOMP_FDF & CAN_RFIFOMP(can_periph, fifo_number)) >> 7U);

        canfd_en = CAN_FDCTL(can_periph) & CAN_FDCTL_FDEN;
        if(!canfd_en) {
            if(CAN_FDF_CLASSIC == receive_message->fd_flag) {
                /* get recevie data length */
                receive_message->rx_dlen = (uint8_t)(GET_RFIFOMP_DLENC(CAN_RFIFOMP(can_periph, fifo_number)));
                /* receive data */
                receive_message->rx_data[0] = (uint8_t)(GET_RFIFOMDATA0_DB0(CAN_RFIFOMDATA0(can_periph, fifo_number)));
                receive_message->rx_data[1] = (uint8_t)(GET_RFIFOMDATA0_DB1(CAN_RFIFOMDATA0(can_periph, fifo_number)));
                receive_message->rx_data[2] = (uint8_t)(GET_RFIFOMDATA0_DB2(CAN_RFIFOMDATA0(can_periph, fifo_number)));
                receive_message->rx_data[3] = (uint8_t)(GET_RFIFOMDATA0_DB3(CAN_RFIFOMDATA0(can_periph, fifo_number)));
                receive_message->rx_data[4] = (uint8_t)(GET_RFIFOMDATA1_DB4(CAN_RFIFOMDATA1(can_periph, fifo_number)));
                receive_message->rx_data[5] = (uint8_t)(GET_RFIFOMDATA1_DB5(CAN_RFIFOMDATA1(can_periph, fifo_number)));
                receive_message->rx_data[6] = (uint8_t)(GET_RFIFOMDATA1_DB6(CAN_RFIFOMDATA1(can_periph, fifo_number)));
                receive_message->rx_data[7] = (uint8_t)(GET_RFIFOMDATA1_DB7(CAN_RFIFOMDATA1(can_periph, fifo_number)));
            } else {
                CAN_ERROR_HANDLE("CAN FD function disabled \r\n");
            }
        } else {
            /* check FD funciton has been enabled */
            /* get recevie data length */
            canfd_recv_cnt = (uint8_t)(GET_RFIFOMP_DLENC(CAN_RFIFOMP(can_periph, fifo_number)));

            if(canfd_recv_cnt <= 8U) {
                /* set the data length */
                receive_message->rx_dlen = canfd_recv_cnt;
            } else {
                receive_message->rx_dlen = g_can_fdlength_table[canfd_recv_cnt - 9U];
            }

            receive_message->fd_brs = (uint8_t)((CAN_RFIFOMP(can_periph, fifo_number) & CAN_RFIFOMP_BRS) >> 5);
            receive_message->fd_esi = (uint8_t)((CAN_RFIFOMP(can_periph, fifo_number) & CAN_RFIFOMP_ESI) >> 4);

            /* get the data */
            i = receive_message->rx_dlen / 4U;

            /* data length is 5-7 need receive 2 word */
            if((1U == i) && (4U != receive_message->rx_dlen)) {
                i++;
            }
            p_temp = (uint32_t)(uint32_t)receive_message->rx_data;
            if(0U == i) {
                data_temp = CAN_RFIFOMDATA0(can_periph, fifo_number);
                *(uint32_t *)p_temp = data_temp;
            } else {
                /* get the data by reading from CAN_RFIFOMDATA0 register*/
                for(; i > 0U; i--) {
                    data_temp = CAN_RFIFOMDATA0(can_periph, fifo_number);
                    *(uint32_t *)p_temp = data_temp;
                    p_temp = ((uint32_t)((uint32_t)p_temp + 4U));
                }
            }
        }

        /* release FIFO */
        if(CAN_FIFO0 == fifo_number) {
            CAN_RFIFO0(can_periph) |= CAN_RFIFO0_RFD0;
        } else {
            CAN_RFIFO1(can_periph) |= CAN_RFIFO1_RFD1;
        }
    }
}

/*!
    \brief      release FIFO (API_ID(0x0013U))
    \param[in]  can_periph
    \arg          CANx(x=0,1)
    \param[in]  fifo_number
                only one parameter can be selected which is shown as below:
      \arg        CAN_FIFOx(x=0,1)
    \param[out] none
    \retval     none
*/
void can_fifo_release(uint32_t can_periph, uint8_t fifo_number)
{
    if(CAN_FIFO0 == fifo_number) {
        CAN_RFIFO0(can_periph) |= CAN_RFIFO0_RFD0;
    } else if(CAN_FIFO1 == fifo_number) {
        CAN_RFIFO1(can_periph) |= CAN_RFIFO1_RFD1;
    } else {
        /* illegal parameters */
        CAN_ERROR_HANDLE("CAN FIFO NUM is invalid \r\n");
    }
}

/*!
    \brief      CAN receive message length (API_ID(0x0014U))
    \param[in]  can_periph
    \param[in]  fifo_number
                only one parameter can be selected which is shown as below:
      \arg        CAN_FIFOx(x=0,1)
    \param[out] none
    \retval     message length
*/
uint8_t can_receive_message_length_get(uint32_t can_periph, uint8_t fifo_number)
{
    uint8_t val = 0U;

    if(CAN_FIFO0 == fifo_number) {
        /* FIFO0 */
        val = (uint8_t)(CAN_RFIFO0(can_periph) & CAN_RFIF_RFL_MASK);
    } else if(CAN_FIFO1 == fifo_number) {
        /* FIFO1 */
        val = (uint8_t)(CAN_RFIFO1(can_periph) & CAN_RFIF_RFL_MASK);
    } else {
        /* illegal parameters */
    }
    return val;
}

/*!
    \brief      set CAN working mode (API_ID(0x0015U))
    \param[in]  can_periph
    \param[in]  can_working_mode
                only one parameter can be selected which is shown as below:
      \arg        CAN_MODE_INITIALIZE
      \arg        CAN_MODE_NORMAL
      \arg        CAN_MODE_SLEEP
    \param[out] none
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus can_working_mode_set(uint32_t can_periph, uint8_t working_mode)
{
    ErrStatus flag = ERROR;
    /* timeout for IWS or also for SLPWS bits */
    uint32_t timeout = CAN_TIMEOUT;

